# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [24]:
# Libraries
import pandas as pd
import numpy as np

# Challenge 1

#### Read the `employees` dataset from Ironhack's database:
* db: `employees`
* table: `employees`

Save your data in a variable called `employees`.

In [18]:
# load file
path = ("C:/Users/meita/Documents/GitHub/data-ft-par-labs/Labs/data/Employees.csv")
employees = pd.read_csv(path)
# move into DataFrame
df_employees = pd.DataFrame(employees)
df_employees

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [27]:
# Method 1
# without pivot tables
df_employees.groupby(['Department'])['Salary'].agg(np.mean)

Department
Admin    76.325203
HR       74.237705
IT       70.671642
Sales    73.132231
Name: Salary, dtype: float64

In [28]:
# Method 2
# with pivot table:
df_employees.pivot_table(index=["Department"])

               Salary     Years
Department
Admin       76.325203  7.642276
HR          74.237705  7.172131
IT          70.671642  8.141791
Sales       73.132231  7.206612

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [30]:
# your code here
df_employees.pivot_table(index=["Department","Title"])

                         Salary     Years
Department Title
Admin      Analyst    77.736842  7.684211
           VP         75.571429  8.142857
           associate  75.813953  7.116279
HR         Analyst    71.404762  7.761905
           VP         75.441176  5.823529
           associate  75.934783  7.630435
IT         Analyst    69.600000  7.688889
           VP         74.000000  8.702128
           associate  68.095238  8.000000
Sales      Analyst    76.074074  8.166667
           VP         66.675000  7.325000
           associate  76.814815  5.111111

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [36]:
df_employees.pivot_table(index=["Title"], columns=['Years'], values=['Salary'])

              Salary                                                         \
Years             1          2          3          4          5          6
Title
Analyst    75.000000  63.384615  73.388889  77.600000  77.615385  87.444444
VP         74.714286  83.200000  69.000000  82.333333  80.000000  61.071429
associate  77.333333  83.250000  83.562500  73.300000  64.333333  74.454545

                                                                             \
Years             7          8          9          10         11         12
Title
Analyst    67.000000  78.000000  86.454545  73.666667  71.181818  68.642857
VP         78.692308  54.181818  65.666667  70.400000  79.363636  76.222222
associate  70.166667  69.500000  76.090909  73.941176  73.750000  77.700000


Years             13         14         15
Title
Analyst    69.571429  70.000000  71.200000
VP         87.000000  74.785714  72.272727
associate  62.222222  62.800000  64.500000

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [46]:
# your code here
count = df_employees.pivot_table(index=["Department","Title"],values=['Name'],aggfunc='count')
salary = df_employees.pivot_table(index=["Department","Title"],values=['Salary'])
sal_num_emp = count.merge(salary, on=["Department","Title"])
sal_num_emp

                      Name     Salary
Department Title
Admin      Analyst      38  77.736842
           VP           42  75.571429
           associate    43  75.813953
HR         Analyst      42  71.404762
           VP           34  75.441176
           associate    46  75.934783
IT         Analyst      45  69.600000
           VP           47  74.000000
           associate    42  68.095238
Sales      Analyst      54  76.074074
           VP           40  66.675000
           associate    27  76.814815

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [49]:
# your code here
df_employees.pivot_table(index=["Department","Title"],values=['Salary'],aggfunc={'median', min, max,
                                                                                np.std})

                     Salary
                        max median   min        std
Department Title
Admin      Analyst    120.0   80.5  33.0  26.335347
           VP         120.0   75.5  31.0  24.927351
           associate  119.0   79.0  30.0  26.524253
HR         Analyst    119.0   72.5  31.0  25.093056
           VP         119.0   76.5  32.0  26.594817
           associate  119.0   76.0  30.0  28.063739
IT         Analyst    119.0   69.0  30.0  28.418464
           VP         120.0   71.0  31.0  25.568323
           associate  117.0   59.5  33.0  28.557866
Sales      Analyst    120.0   72.0  30.0  27.855999
           VP         119.0   60.0  30.0  27.017931
           associate  120.0   79.0  31.0  28.266638

In [53]:
df_employees.isna().sum()

Department    0
Education     0
Title         0
Name          0
Years         0
Salary        0
dtype: int64

In [51]:
df_employees.head()

  Department Education      Title      Name  Years  Salary
0      Admin    Master  associate     David      4      58
1         IT    Master  associate    Thomas      7      45
2      Admin    Master  associate     Diana     10      52
3      Admin    Master         VP  Manuella     15      33
4      Sales    Master    Analyst     Carla      6      38

In [ ]:
"""
It appears that the max salary is almost the same for of the depertments, regardless of the job title. 
So it the minimum pay - which doesn't make sense. 
associate have the biggest standart diviation - meaning the salary varies more. but not by a large diffrence then 
the rest.Most IT associates get payed much less then the rest. 
"""

#### Based on your comments, fill the missing values with an appropriate value.

In [ ]:
# your code here
# there's no missing values

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [62]:
# your code here
count = df_employees.pivot_table(index=["Department"],values=['Name'],aggfunc='count')
sal = df_employees.pivot_table(index=["Department"],values=['Salary'], aggfunc=np.sum)
count.merge(sal, on=["Department"])

            Name  Salary
Department
Admin        123    9388
HR           122    9057
IT           134    9470
Sales        121    8849

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [67]:
# your code here
mean_sal = df_employees.pivot_table(index=["Title","Department"],values=['Salary'])
tot_ex_years = df_employees.pivot_table(index=["Title","Department"],values=['Years'], aggfunc=np.sum)
mean_sal.merge(tot_ex_years, on=["Title","Department"])

                         Salary  Years
Title     Department
Analyst   Admin       77.736842    292
          HR          71.404762    326
          IT          69.600000    346
          Sales       76.074074    441
VP        Admin       75.571429    342
          HR          75.441176    198
          IT          74.000000    409
          Sales       66.675000    293
associate Admin       75.813953    306
          HR          75.934783    351
          IT          68.095238    336
          Sales       76.814815    138

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [ ]:
# your code here 
# GO BACK TO DO THIS!

# Challenge 2

#### Read the `fitbit` dataset from Ironhack's database:
* db: `fitbit`
* table: `fitbit`

Save your data in a variable called `fitbit`.

In [ ]:
# your code here

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [ ]:
# your code here

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [ ]:
import matplotlib.pyplot as plt;

In [ ]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [ ]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your code here

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [ ]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [ ]:
# your code here

#### Show visually the frequency distribution of the `time_grades` dataset.

In [ ]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Could you explain the difference between Pearson and Spearman correlations?

In [ ]:
"""
your commments here
"""